<template>
  <div>
    <NuxtLayout>
      <NuxtPage />
    </NuxtLayout>
    <LayoutAuthModal v-model="authStore.showAuth" />
  </div>
</template>
<script setup lang="ts">
import { useAuthStore } from '~/store/auth'

const authStore = useAuthStore()

useSeoMeta({
  title: 'Холодильник Онлайн',
  description:
    'Добро пожаловать в Магазин Холодильник — ваш универсальный онлайн-магазин для всех продуктов, требующих хранения в холодильнике! В нашем ассортименте вы найдете свежие и качественные молочные продукты, мясо, рыбу, овощи, фрукты, готовые блюда и многое другое. Мы обеспечиваем быструю и надежную доставку прямо к вашему порогу, чтобы вы могли наслаждаться вкусной и здоровой пищей каждый день. Откройте для себя удобство покупок с Магазин Холодильник!',
  ogTitle: `Холодильник Онлайн`,
  ogDescription: `Добро пожаловать в Магазин Холодильник — ваш универсальный онлайн-магазин для всех продуктов, требующих хранения в холодильнике! В нашем ассортименте вы найдете свежие и качественные молочные продукты, мясо, рыбу, овощи, фрукты, готовые блюда и многое другое. Мы обеспечиваем быструю и надежную доставку прямо к вашему порогу, чтобы вы могли наслаждаться вкусной и здоровой пищей каждый день. Откройте для себя удобство покупок с Магазин Холодильник!`,
  twitterTitle: `Холодильник Онлайн`,
  twitterCard: 'summary',
  twitterSite: '@xolodilnik',
  ogImage: '/og.png',
  twitterImage: '/og.png',
})
</script>
